app/controllers/reviews_controller.rb

  def create
    Review.create(create_params)
---
INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('sho', 5, 'interesting', 1, '2017-02-23 16:36:42', '2017-02-23 16:36:42')